dependencies/OpenFOAM/tutorials/incompressible/adjointOptimisationFoam/topologyOptimisation/monoFluidAero/turbulent/1_Inlet_2_Outlet/levelSet/R_05x_NB_01/reEval/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1.e-4;

boundaryField
{
    frontBack
    {
        type            empty;
    }

    designWall 
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }

    topOPatch 
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }

    IEntranceWall
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }

    OEntranceWall
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }

    OREntranceWall
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }

    inlet  
    {
        type            fixedValue;
        value           uniform 1.e-4;
    }

    outlet
    {
        type            zeroGradient;
    }

    outlet-right
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
